Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_flash.h
/** @defgroup FLASH_OB_USER_Type FLASH User Option Type
  * @{
  */
#define OB_USER_IWDG_SW                 FLASH_OPTR1_IWDG_SW
#define OB_USER_IWDG_STOP               FLASH_OPTR1_IWDG_STOP
#define OB_USER_IWDG_STDBY              FLASH_OPTR1_IWDG_STDBY
#define OB_USER_BFB                     FLASH_OPTR1_BFB
#define OB_USER_NRST_STOP               FLASH_OPTR1_NRST_STOP
#define OB_USER_NRST_STDBY              FLASH_OPTR1_NRST_STDBY
#define OB_USER_WWDG_SW                 FLASH_OPTR1_WWDG_SW

#define OB_USER_NBOOT1                  (FLASH_OPTR2_NBOOT1 << 16)             /*!< Boot configuration */
#define OB_USER_NRST_MODE0              (FLASH_OPTR2_NRST_MODE_0 << 16)        /*!< Reset pin configuration */
#define OB_USER_NRST_MODE1              (FLASH_OPTR2_NRST_MODE_1 << 16)        /*!< Reset pin configuration */
#define OB_USER_NRST_MODE               (FLASH_OPTR2_NRST_MODE << 16)          /*!< Reset pin configuration */
#define OB_USER_SRAM_PE                 (FLASH_OPTR2_SRAM_PE << 16)            /*!< SRAM parity check enable (first 32kB of SRAM1 + CCM SRAM) */
#define OB_USER_CCMSRAM_RST             (FLASH_OPTR2_CCMSRAM_RST << 16)        /*!< CCMSRAM Erase when system reset */
#define OB_USER_NSWBOOT0                (FLASH_OPTR2_NSWBOOT0 << 16)           /*!< Software BOOT0 */
#define OB_USER_NBOOT0                  (FLASH_OPTR2_NBOOT0 << 16)             /*!< nBOOT0 option bit */
#define OB_USER_BOOT_LOCK               (FLASH_OPTR2_BOOT_LOCK << 16)          /*!< Force boot from user Flash area bit */

#define OB_USER_OPTR1_MSK               (OB_USER_IWDG_SW  | OB_USER_IWDG_STOP | OB_USER_IWDG_STDBY | \
                                         OB_USER_BFB      | OB_USER_NRST_STOP | OB_USER_NRST_STDBY | \
                                         OB_USER_WWDG_SW)
#define OB_USER_OPTR2_MSK               (OB_USER_NBOOT1   | OB_USER_SRAM_PE   | OB_USER_CCMSRAM_RST| \
                                         OB_USER_NSWBOOT0 | OB_USER_NBOOT0    | OB_USER_NRST_MODE0 | \
                                         OB_USER_NRST_MODE1 | OB_USER_BOOT_LOCK)
#define OB_USER_OPTR_MSK                (OB_USER_OPTR1_MSK | OB_USER_OPTR2_MSK)
/**
  * @}
  */

/** @defgroup FLASH_Option_Bytes_Write_Protection FLASH Option Bytes Write Protection
  * @{
  */
#define FLASH_WRPR_WRP_0                0x00000001U  /* Write protection of Block0 */
#define FLASH_WRPR_WRP_1                0x00000002U  /* Write protection of Block1 */
#define FLASH_WRPR_WRP_2                0x00000004U  /* Write protection of Block2 */
#define FLASH_WRPR_WRP_3                0x00000008U  /* Write protection of Block3 */
#define FLASH_WRPR_WRP_4                0x00000010U  /* Write protection of Block4 */
#define FLASH_WRPR_WRP_5                0x00000020U  /* Write protection of Block5 */
#define FLASH_WRPR_WRP_6                0x00000040U  /* Write protection of Block6 */
#define FLASH_WRPR_WRP_7                0x00000080U  /* Write protection of Block7 */

#define OB_WRP_BLOCK_0                  FLASH_WRPR_WRP_0  /* Write protection of Block0 */
#define OB_WRP_BLOCK_1                  FLASH_WRPR_WRP_1  /* Write protection of Block1 */
#define OB_WRP_BLOCK_2                  FLASH_WRPR_WRP_2  /* Write protection of Block2 */
#define OB_WRP_BLOCK_3                  FLASH_WRPR_WRP_3  /* Write protection of Block3 */
#define OB_WRP_BLOCK_4                  FLASH_WRPR_WRP_4  /* Write protection of Block4 */
#define OB_WRP_BLOCK_5                  FLASH_WRPR_WRP_5  /* Write protection of Block5 */
#define OB_WRP_BLOCK_6                  FLASH_WRPR_WRP_6  /* Write protection of Block6 */
#define OB_WRP_BLOCK_7                  FLASH_WRPR_WRP_7  /* Write protection of Block7 */

#define OB_WRP_Pages0to127              OB_WRP_BLOCK_0    /* Write protection of Block0 */
#define OB_WRP_Pages128to255            OB_WRP_BLOCK_1    /* Write protection of Block1 */
#define OB_WRP_Pages256to383            OB_WRP_BLOCK_2    /* Write protection of Block2 */
#define OB_WRP_Pages384to511            OB_WRP_BLOCK_3    /* Write protection of Block3 */
#define OB_WRP_Pages512to639            OB_WRP_BLOCK_4    /* Write protection of Block4 */
#define OB_WRP_Pages640to767            OB_WRP_BLOCK_5    /* Write protection of Block5 */
#define OB_WRP_Pages768to895            OB_WRP_BLOCK_6    /* Write protection of Block6 */
#define OB_WRP_Pages896to1023           OB_WRP_BLOCK_7    /* Write protection of Block7 */
#define OB_WRP_AllPages                 FLASH_WRPR_WRP    /* Write protection of all Blocks */
/**
  * @}
  */
  
/** @defgroup FLASH_Type_Program FLASH type program
  * @{
  */
#define FLASH_TYPEPROGRAM_PAGE          FLASH_CR_PG  /*!<Program 256bytes at a specified address.*/  
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_NRST_STOP FLASH Option Bytes NRST_STOP
  * @{
  */
#define OB_STOP_RST                     0x00000000U           /*!< Reset generated when entering Stop mode */
#define OB_STOP_NORST                   FLASH_OPTR1_NRST_STOP /*!< No reset generated when entering Stop mode*/
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_nRST_STANDBY FLASH Option Bytes User Reset On Standby
  * @{
  */
#define OB_STANDBY_RST                  0x00000000U              /*!< Reset generated when entering the standby mode */
#define OB_STANDBY_NORST                FLASH_OPTR1_NRST_STDBY   /*!< No reset generated when entering the standby mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_IWDG_SW FLASH Option Bytes IWatchdog
  * @{
  */
#define OB_IWDG_HW                      0x00000000U          /*!< Hardware IWDG selected */
#define OB_IWDG_SW                      FLASH_OPTR1_IWDG_SW  /*!< Software IWDG selected */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_IWDG_STOP FLASH Option Bytes User IWDG Mode On Stop
  * @{
  */
#define OB_IWDG_STOP_FREEZE             0x00000000U              /*!< Independent watchdog counter is frozen in Stop mode */
#define OB_IWDG_STOP_RUN                FLASH_OPTR1_IWDG_STOP    /*!< Independent watchdog counter is running in Stop mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_IWDG_STANDBY FLASH Option Bytes User IWDG Mode On Standby
  * @{
  */
#define OB_IWDG_STDBY_FREEZE            0x00000000U              /*!< Independent watchdog counter is frozen in Standby mode */
#define OB_IWDG_STDBY_RUN               FLASH_OPTR1_IWDG_STDBY    /*!< Independent watchdog counter is running in Standby mode */
/**
  * @}
  */

