Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_flash.h
#define IS_OB_USER_WWDG(__VALUE__)                    (((__VALUE__) == OB_WWDG_HW) || \
                                                       ((__VALUE__) == OB_WWDG_SW))
                                                       
#define IS_OB_USER_BFB(__VALUE__)                     (((__VALUE__) == OB_BFB_START_BANK0) || \
                                                       ((__VALUE__) == OB_BFB_START_BANK1))

#define IS_OB_USER_BOOT1(__VALUE__)                   (((__VALUE__) == OB_BOOT1_SRAM) || \
                                                       ((__VALUE__) == OB_BOOT1_SYSTEM))

#define IS_OB_USER_SRAM_PARITY(__VALUE__)             (((__VALUE__) == OB_SRAM_PARITY_ENABLE) || \
                                                       ((__VALUE__) == OB_SRAM_PARITY_DISABLE))

#define IS_OB_USER_CCMSRAM_RST(__VALUE__)             (((__VALUE__) == OB_CCMSRAM_RST_ERASE) || \
                                                       ((__VALUE__) == OB_CCMSRAM_RST_NOT_ERASE))

#define IS_OB_USER_SWBOOT0(__VALUE__)                 (((__VALUE__) == OB_BOOT0_FROM_OB) || \
                                                       ((__VALUE__) == OB_BOOT0_FROM_PIN))

#define IS_OB_USER_BOOT0(__VALUE__)                   (((__VALUE__) == OB_NBOOT0_RESET) || \
                                                       ((__VALUE__) == OB_NBOOT0_SET))

#define IS_OB_USER_NRST_MODE(__VALUE__)               (((__VALUE__) == OB_NRST_MODE_GPIO) || \
                                                       ((__VALUE__) == OB_NRST_MODE_INPUT_ONLY) || \
                                                       ((__VALUE__) == OB_NRST_MODE_INPUT_OUTPUT))

#define IS_FLASH_LATENCY(__LATENCY__)                  (((__LATENCY__) == FLASH_LATENCY_0)  || \
                                                        ((__LATENCY__) == FLASH_LATENCY_1)  || \
                                                        ((__LATENCY__) == FLASH_LATENCY_3)  || \
                                                        ((__LATENCY__) == FLASH_LATENCY_4)  || \
                                                        ((__LATENCY__) == FLASH_LATENCY_5)  || \
                                                        ((__LATENCY__) == FLASH_LATENCY_6)  || \
                                                        ((__LATENCY__) == FLASH_LATENCY_7))

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32E407_HAL_FLASH_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
